//За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви).
//Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А.
//Да се креира нова матрица B на следниот начин:
//сите елементи од главната дијагонала во матрицата B треба да имаат вредност X
//сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y
//ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y
//сите останати елементи во матрицата B имаат вредност 0
//Новата матрица B да се испечати на стандарден излез.

#include <iostream>
using namespace std;
int main(){
    float m[100][100];
    int n;
    cin>>n;
    int i,j;
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            cin>>m[i][j];
        }
    }
    float x=0;
    float y=0;
    for(i=1;i<n;i++){
        for(j=0;j<i;j++){
            x+=m[i][j];
        }
    }
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            if(i>n-j-1){
                y+=m[i][j];
            }
        }
    }
    float b[100][100];

    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            if(i==j){
                b[i][j]=x;
            }
        }
    }
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            if(j==n-i-1){
                b[i][j]=y;
            }
        }
    }
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            if(n%2!=0&&i==n/2&&j==n/2){
                b[i][j]=y+x;
            }
        }
    }

    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            cout<<b[i][j]<<" ";
        }
        cout<<endl;
    }







}
