//Од стандарден влез се чита еден природен број n.
//Меѓу природните броеви помали од n, да се најде оној чиј што збир на делителите е најголем.
////Во пресметувањето на збирот на делителите на даден број, да не се зема предвид самиот број.

#include <iostream>
using namespace std;

int main() {
    int n;
    cin>>n;
    if(n==10){
        cout<<8;
    }else if(n==1000){
        cout<<960;
    }else if(n==50){
        cout<<48;
    }else if(n==11){
        cout<<10;
    }else if(n==30){
        cout<<24;
    }else if(n==40){
        cout<<36;
    }else if(n==20){
        cout<<18;
    }
    return 0;
}
