//Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).
//Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата.
//Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата.
// Ако индексот ind е поголем од Nфункцијата треба да врати 0.
//НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).


#include <iostream>
using namespace std;

void sumod(const int *a,int ind,int size){
    int sum=0;
    for(int i=ind;i<size;i++){
        sum+=a[i];
    }
    cout<<sum;
}


int main(){
    int a[100];
    int size;
    cin>>size;
    int i;
    for(i=0;i<size;i++){
        cin>>a[i];
    }

    int ind;
    cin>>ind;
    sumod(a,ind,size);

}
